Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes Constructor (DimensionSetBaseAttributes.DimensionValuePrecisions, DimensionSetBaseAttributes.DimensionValueFormats, DimensionSetBaseAttributes.DimensionValueUnits)
 Creates a new dimension format attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionFormatAttributes(
	DimensionSetBaseAttributes.DimensionValuePrecisions precision,
	DimensionSetBaseAttributes.DimensionValueFormats format,
	DimensionSetBaseAttributes.DimensionValueUnits unit
)
Public Sub New (
	precision As DimensionSetBaseAttributes.DimensionValuePrecisions,
	format As DimensionSetBaseAttributes.DimensionValueFormats,
	unit As DimensionSetBaseAttributes.DimensionValueUnits
)
Parameters
precision
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions
The precision of the dimension.
format
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueFormats
The format of the dimension.
unit
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValueUnits
The unit of the dimension.
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
DimensionSetBaseAttributes.DimensionFormatAttributes Overload
Tekla.Structures.Drawing Namespace